{
  "Docs": "Dokumente",
  "Contact": "Kontakt",
  "Language": "Sprache",
  "Simple, fast, and lightweight internationalization for modern web applications.": "Einfache, schnelle und leichte Internationalisierung für moderne Webanwendungen.",
  "Links": "Links",
  "Documentation": "Dokumentation",
  "i18n-lazy. All rights reserved.": "i18n-lazy. Alle Rechte vorbehalten.",
  "Effortless Internationalization": "Effortlose Internationalisierung",
  "for Modern Web Apps": "für moderne Webanwendungen",
  "Translate your content instantly with zero effort.": "Übersetzen Sie Ihre Inhalte sofort und ohne Aufwand.",
  "Read the Docs": "Dokumente lesen",
  "Introduction": "Einführung",
  "Effortlessly automate your translation process and expand your reach globally. With lazy-i18n, going global has never been easier. Just sit back, relax, and let your translations happen lazily.": "Automatisieren Sie Ihren Übersetzungsprozess mühelos und erweitern Sie Ihre Reichweite weltweit. Mit lazy-i18n ist die Globalisierung noch nie so einfach gewesen. Lehnen Sie sich zurück, entspannen Sie sich und lassen Sie Ihre Übersetzungen auf bequeme Weise geschehen.",
  "Features": "Funktionen",
  "Installation": "Installation",
  "Recommended File Structure": "Empfohlene Dateistruktur",
  "Quick Start": "Schnellstart",
  "Initialize Configuration": "Konfiguration initialisieren",
  "Configuration File": "Konfigurationsdatei",
  "Project Setup": "Projekteinrichtung",
  "Basic Usage": "Grundlegende Verwendung",
  "API Reference": "API-Referenz",
  "TranslationProvider": "Übersetzungsanbieter",
  "useTranslation Hook": "useTranslation Hook",
  "translate Function": "translate Funktion",
  "Configuration": "Konfiguration",
  "Configuration Options": "Konfigurationsoptionen",
  "Environment Variables": "Umgebungsvariablen",
  "CLI Commands": "CLI-Befehle",
  " Effortlessly automate your translation process and expand your reach globally. With i18n-lazy, going global has never been easier. Just sit back, relax, and let your translations happen lazily.": "Automatisieren Sie Ihren Übersetzungsprozess mühelos und erweitern Sie Ihre Reichweite weltweit. Mit i18n-lazy war die Globalisierung noch nie so einfach. Lehnen Sie sich zurück, entspannen Sie sich und lassen Sie Ihre Übersetzungen auf bequeme Weise geschehen.",
  "Get started by installing the package using npm or yarn:": "Beginnen Sie mit der Installation des Pakets mit npm oder yarn:",
  "1. Initialize Configuration": "1. Konfiguration initialisieren",
  "Run the initialization command to create your configuration file:": "Führen Sie den Initialisierungsbefehl aus, um Ihre Konfigurationsdatei zu erstellen:",
  "2. Configure Your Settings": "2. Konfigurieren Sie Ihre Einstellungen",
  "Update the generated i18n-lazy.config.js with your settings:": "Aktualisieren Sie die generierte i18n-lazy.config.js mit Ihren Einstellungen:",
  "3. Set Up Provider": "3. Anbieter einrichten",
  "Wrap your app with the TranslationProvider:": "Verpacken Sie Ihre App mit dem TranslationProvider:",
  "4. Use in Components": "4. In Komponenten verwenden",
  "Start using translations in your components:": "Beginnen Sie mit der Verwendung von Übersetzungen in Ihren Komponenten:",
  "The main provider component that wraps your application:": "Die Hauptkomponente des Anbieters, die Ihre Anwendung umschließt:",
  "Hook for accessing translation functionality:": "Hook für den Zugriff auf die Übersetzungsfunktionalität:",
  "The translate function supports basic translation and interpolation:": "Die translate-Funktion unterstützt einfache Übersetzung und Interpolation:",
  "Create a .env file in your project root with your Gemini API key:": "Erstellen Sie eine .env-Datei in Ihrem Projektstammverzeichnis mit Ihrem Gemini-API-Schlüssel:",
  "it is  a youtube video, please watch and have fun": "Es ist ein YouTube-Video, schau es dir an und hab Spaß"
}