{
  "Docs": "Documentos",
  "Contact": "Contacto",
  "Language": "Idioma",
  "Simple, fast, and lightweight internationalization for modern web applications.": "Internacionalización simple, rápida y ligera para aplicaciones web modernas.",
  "Links": "Enlaces",
  "Documentation": "Documentación",
  "i18n-lazy. All rights reserved.": "i18n-lazy. Todos los derechos reservados.",
  "Effortless Internationalization": "Internacionalización sin esfuerzo",
  "for Modern Web Apps": "para aplicaciones web modernas",
  "Translate your content instantly with zero effort.": "Traduce tu contenido al instante sin ningún esfuerzo.",
  "Read the Docs": "Leer la documentación",
  "Introduction": "Introducción",
  "Effortlessly automate your translation process and expand your reach globally. With lazy-i18n, going global has never been easier. Just sit back, relax, and let your translations happen lazily.": "Automatiza tu proceso de traducción sin esfuerzo y amplía tu alcance global. Con lazy-i18n, internacionalizar nunca ha sido tan fácil. Solo siéntate, relájate y deja que tus traducciones sucedan sin esfuerzo.",
  "Features": "Características",
  "Installation": "Instalación",
  "Recommended File Structure": "Estructura de archivos recomendada",
  "Quick Start": "Inicio rápido",
  "Initialize Configuration": "Inicializar configuración",
  "Configuration File": "Archivo de configuración",
  "Project Setup": "Configuración del proyecto",
  "Basic Usage": "Uso básico",
  "API Reference": "Referencia de API",
  "TranslationProvider": "Proveedor de traducción",
  "useTranslation Hook": "Gancho useTranslation",
  "translate Function": "Función translate",
  "Configuration": "Configuración",
  "Configuration Options": "Opciones de configuración",
  "Environment Variables": "Variables de entorno",
  "CLI Commands": "Comandos CLI",
  " Effortlessly automate your translation process and expand your reach globally. With i18n-lazy, going global has never been easier. Just sit back, relax, and let your translations happen lazily.": "Automatiza tu proceso de traducción sin esfuerzo y amplía tu alcance global. Con i18n-lazy, internacionalizar nunca ha sido tan fácil. Solo siéntate, relájate y deja que tus traducciones sucedan sin esfuerzo.",
  "Get started by installing the package using npm or yarn:": "Comienza instalando el paquete usando npm o yarn:",
  "1. Initialize Configuration": "1. Inicializar configuración",
  "Run the initialization command to create your configuration file:": "Ejecuta el comando de inicialización para crear tu archivo de configuración:",
  "2. Configure Your Settings": "2. Configura tus ajustes",
  "Update the generated i18n-lazy.config.js with your settings:": "Actualiza el archivo i18n-lazy.config.js generado con tus ajustes:",
  "3. Set Up Provider": "3. Configura el proveedor",
  "Wrap your app with the TranslationProvider:": "Envuelve tu aplicación con el TranslationProvider:",
  "4. Use in Components": "4. Usa en componentes",
  "Start using translations in your components:": "Comienza a usar traducciones en tus componentes:",
  "The main provider component that wraps your application:": "El componente principal del proveedor que envuelve tu aplicación:",
  "Hook for accessing translation functionality:": "Gancho para acceder a la funcionalidad de traducción:",
  "The translate function supports basic translation and interpolation:": "La función translate admite traducción básica e interpolación:",
  "Create a .env file in your project root with your Gemini API key:": "Crea un archivo .env en la raíz de tu proyecto con tu clave de API de Gemini:",
  "it is  a youtube video, please watch and have fun": "es un video de youtube, por favor mira y diviértete"
}