{
  "Docs": "Documents",
  "Contact": "Contact",
  "Language": "Langue",
  "Simple, fast, and lightweight internationalization for modern web applications.": "Internationalisation simple, rapide et légère pour les applications Web modernes.",
  "Links": "Liens",
  "Documentation": "Documentation",
  "i18n-lazy. All rights reserved.": "i18n-lazy. Tous droits réservés.",
  "Effortless Internationalization": "Internationalisation sans effort",
  "for Modern Web Apps": "pour les applications web modernes",
  "Translate your content instantly with zero effort.": "Traduisez votre contenu instantanément sans aucun effort.",
  "Read the Docs": "Lire la documentation",
  "Introduction": "Introduction",
  "Effortlessly automate your translation process and expand your reach globally. With lazy-i18n, going global has never been easier. Just sit back, relax, and let your translations happen lazily.": "Automatisez votre processus de traduction sans effort et élargissez votre portée mondiale. Avec lazy-i18n, l'internationalisation n'a jamais été aussi simple. Asseyez-vous, détendez-vous et laissez vos traductions se faire tranquillement.",
  "Features": "Fonctionnalités",
  "Installation": "Installation",
  "Recommended File Structure": "Structure de fichiers recommandée",
  "Quick Start": "Démarrage rapide",
  "Initialize Configuration": "Initialiser la configuration",
  "Configuration File": "Fichier de configuration",
  "Project Setup": "Configuration du projet",
  "Basic Usage": "Utilisation de base",
  "API Reference": "Référence de l'API",
  "TranslationProvider": "TranslationProvider",
  "useTranslation Hook": "Crochet useTranslation",
  "translate Function": "Fonction translate",
  "Configuration": "Configuration",
  "Configuration Options": "Options de configuration",
  "Environment Variables": "Variables d'environnement",
  "CLI Commands": "Commandes CLI",
  " Effortlessly automate your translation process and expand your reach globally. With i18n-lazy, going global has never been easier. Just sit back, relax, and let your translations happen lazily.": "Automatisez votre processus de traduction sans effort et élargissez votre portée mondiale. Avec i18n-lazy, l'internationalisation n'a jamais été aussi simple. Asseyez-vous, détendez-vous et laissez vos traductions se faire tranquillement.",
  "Get started by installing the package using npm or yarn:": "Commencez par installer le package à l'aide de npm ou yarn :",
  "1. Initialize Configuration": "1. Initialiser la configuration",
  "Run the initialization command to create your configuration file:": "Exécutez la commande d'initialisation pour créer votre fichier de configuration :",
  "2. Configure Your Settings": "2. Configurez vos paramètres",
  "Update the generated i18n-lazy.config.js with your settings:": "Mettez à jour le fichier i18n-lazy.config.js généré avec vos paramètres :",
  "3. Set Up Provider": "3. Configurer le fournisseur",
  "Wrap your app with the TranslationProvider:": "Enveloppez votre application avec le TranslationProvider :",
  "4. Use in Components": "4. Utiliser dans les composants",
  "Start using translations in your components:": "Commencez à utiliser les traductions dans vos composants :",
  "The main provider component that wraps your application:": "Le composant principal du fournisseur qui enveloppe votre application :",
  "Hook for accessing translation functionality:": "Crochet pour accéder à la fonctionnalité de traduction :",
  "The translate function supports basic translation and interpolation:": "La fonction translate prend en charge la traduction de base et l'interpolation :",
  "Create a .env file in your project root with your Gemini API key:": "Créez un fichier .env à la racine de votre projet avec votre clé API Gemini :",
  "it is  a youtube video, please watch and have fun": "c'est une vidéo YouTube, regardez et amusez-vous"
}